Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraints.End Property
 Data related to the second part end.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisRestraintData End { get; set; }
Public Property End As AnalysisRestraintData
	Get
	Set
Property Value
Type: AnalysisRestraintData
See Also
Reference
AnalysisRestraints Class
Tekla.Structures.Analysis Namespace